today-II-2021-11-15.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-29 月 11:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>10/25 RforS (データ解析)</title>
<meta name="author" content="suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">10/25 RforS (データ解析)</h1>

<div id="outline-container-org5ee0961" class="outline-2">
<h2 id="org5ee0961">11/15 06回目の講義内容</h2>
<div class="outline-text-2" id="text-org5ee0961">
<p>
<a href="http://wiki.cis.iwate-u.ac.jp/~suzuki/RforS/today.html">http://wiki.cis.iwate-u.ac.jp/~suzuki/RforS/today.html</a>
</p>
</div>

<div id="outline-container-orgc4819ad" class="outline-3">
<h3 id="orgc4819ad"><span class="todo Doing">Doing</span> お知らせ   SCHEDULED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-11-01 月&gt;</span></span></h3>
<div class="outline-text-3" id="text-orgc4819ad">
</div>
<div id="outline-container-org79d2291" class="outline-4">
<h4 id="org79d2291">来週 11/22 は休講です。</h4>
</div>

<div id="outline-container-org3a2344c" class="outline-4">
<h4 id="org3a2344c">1回目のレポートを出題しました。</h4>
<div class="outline-text-4" id="text-org3a2344c">
<p>
Webclassを見てください。
</p>

<p>
〆切は，いちおう，11/15日です。   
</p>
</div>
</div>
</div>

<div id="outline-container-orgf3c85c5" class="outline-3">
<h3 id="orgf3c85c5"><span class="done Done">Done</span> 関連</h3>
<div class="outline-text-3" id="text-orgf3c85c5">
</div>
<div id="outline-container-org0c770dc" class="outline-4">
<h4 id="org0c770dc"><span class="done Done">Done</span> このページ</h4>
<div class="outline-text-4" id="text-org0c770dc">
<p>
<a href="https://github.com/masayuki054/RforS/blob/main/today.org">RforS/today.org at main · masayuki054/RforS · GitHub</a>
</p>

<ul class="org-ul">
<li>今日のオンライン講義の説明の流れです。</li>
<li>Emacs org-mode で書いています。
<ul class="org-ul">
<li><a href="http://misohena.jp/blog/2017-10-26-how-to-use-code-block-of-emacs-org-mode.html#lang-r">org-modeのコードブロック(Babel)の使い方 | Misohena Blog</a></li>
</ul></li>
<li>github からダウンロード可能です。</li>
<li>~suzuki/public_html/stat2 からもアクセスできます。</li>
</ul>
</div>
</div>

<div id="outline-container-org2c4980c" class="outline-4">
<h4 id="org2c4980c"><span class="done Done">Done</span> 講義ノート</h4>
<div class="outline-text-4" id="text-org2c4980c">
<p>
<a href="https://drive.google.com/drive/u/0/folders/1nGs6svr0actrLPmtz6onPuj2eUrHMQ8M">note - Google ドライブ</a>
</p>
<ul class="org-ul">
<li>板書用の手書きノート</li>
</ul>
</div>
</div>

<div id="outline-container-org69e1068" class="outline-4">
<h4 id="org69e1068"><span class="done Done">Done</span> Rに関すること</h4>
<div class="outline-text-4" id="text-org69e1068">
<ul class="org-ul">
<li><a href="./org/R-info.html">./org/R-info.html</a></li>
<li><a href="http://cse.naro.affrc.go.jp/takezawa/r-tips.pdf">R-Tips - r-tips.pdf</a></li>
<li><a href="http://www.okadajp.org/RWiki/?R%E3%81%AE%E5%9F%BA%E6%9C%AC%E3%83%91%E3%83%83%E3%82%B1%E3%83%BC%E3%82%B8%E4%B8%AD%E3%81%AE%E7%A2%BA%E7%8E%87%E5%88%86%E5%B8%83%E3%80%81%E4%B9%B1%E6%95%B0%E9%96%A2%E6%95%B0%E4%B8%80%E8%A6%A7">Rの基本パッケージ中の確率分布、乱数関数一覧 - RjpWiki</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcec9378" class="outline-4">
<h4 id="orgcec9378"><span class="done Done">Done</span> 参考書</h4>
<div class="outline-text-4" id="text-orgcec9378">
<ul class="org-ul">
<li><a href="http://whitewell.sakura.ne.jp/R/">Webpage for Probability Theory and Statistics (B)</a> 
<ul class="org-ul">
<li>中京大 白井先生, Rによるやさしい統計学</li>
</ul></li>

<li><a href="http://www.cc.aoyama.ac.jp/~t41338/lecture/aoyama/stat2e/stat2e_top.html">社会統計演習</a> (青山大学)
<ul class="org-ul">
<li>Rによるやさしい統計学の動画による解説</li>
</ul></li>
</ul>
<ul class="org-ul">
<li><a href="https://www.ohmsha.co.jp/book/9784274227387/">入門 統計学（第2版） 検定から多変量解析・実験計画法・ベイズ統計学まで | Ohmsha</a>
<ul class="org-ul">
<li>絵が豊富</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-org63c702c" class="outline-4">
<h4 id="org63c702c"><span class="done Done">Done</span> 気をつけること</h4>
<div class="outline-text-4" id="text-org63c702c">
<ul class="org-ul">
<li>講義ノート・教科書を読んでもらってから，説明すること</li>

<li>プログラムは説明してから，入力の時間をとり，その後説明しながら実行
すること</li>
</ul>
</div>
</div>

<div id="outline-container-org6324a57" class="outline-4">
<h4 id="org6324a57"><span class="done Done">Done</span> 分布表</h4>
<div class="outline-text-4" id="text-org6324a57">
<p>
R が使えないときに，確率計算に使ってください。
</p>

<ul class="org-ul">
<li><a href="http://www3.u-toyama.ac.jp/kkarato/2019/statistics/table/z.pdf">標準正規分布配布用 - z.pdf</a></li>
<li><a href="http://www3.u-toyama.ac.jp/kkarato/2019/statistics/table/t.pdf">t分布 - t.pdf</a></li>
<li><a href="http://www3.u-toyama.ac.jp/kkarato/2019/statistics/table/chisq.pdf">CHISQ-TABLE.docx - chisq.pdf</a></li>
<li><a href="http://www3.u-toyama.ac.jp/kkarato/2019/statistics/table/F.pdf">Fs - F.pdf</a></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org3bad359" class="outline-3">
<h3 id="org3bad359">2冊の教科書と進行</h3>
<div class="outline-text-3" id="text-org3bad359">
<p>
確率と統計
</p>
<ul class="org-ul">
<li>K: 進行 K-7, K-5, K-8, K-10, K-11, K-12</li>
</ul>

<p>
Rによるやさしい統計学
</p>
<ul class="org-ul">
<li>R: (R-4, R-5, R-6, R-7)， (R-8, R-9)</li>
</ul>
</div>

<div id="outline-container-org1619eec" class="outline-4">
<h4 id="org1619eec">対応 <code>[3/6]</code></h4>
<div class="outline-text-4" id="text-org1619eec">
<ul class="org-ul">
<li class="on"><code>[X]</code> 標本と統計的推測 K-7:R-4</li>
<li class="on"><code>[X]</code> 大数の法則と中心極限定理 K-5:R-4</li>
<li class="on"><code>[X]</code> 点推定 K-8: (R-4, R-5)</li>
<li class="trans"><code>[-]</code> 区間推定 K-10:R-4</li>
<li class="off"><code>[&#xa0;]</code> 検定 K-11, R-5</li>
<li class="off"><code>[&#xa0;]</code> いろいろな検定 K-12:(R-6, R-7)</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgef96e46" class="outline-3">
<h3 id="orgef96e46">講師のノート</h3>
<div class="outline-text-3" id="text-orgef96e46">
<ul class="org-ul">
<li>Rノート  <a href="./org/RforS-II-index.html">./org/RforS-II-index.html</a></li>

<li>昨年の講義ノート <a href="https://drive.google.com/drive/folders/1vFIqux3NytwvUEygZ74O9XzuyCoJfj7D">lect-note - Google ドライブ</a>  の 8章，7章，5章</li>
<li>昨年の板書  <a href="https://drive.google.com/drive/u/0/folders/10uKe0TnjEjoQxigeXfyjh_4ZTzxmoCNI">board-2020 - Google ドライブ</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgdf80d56" class="outline-3">
<h3 id="orgdf80d56">今日 (11/15) の流れ</h3>
<div class="outline-text-3" id="text-orgdf80d56">
</div>
<div id="outline-container-org136782f" class="outline-4">
<h4 id="org136782f"><span class="done Done">Done</span> 標本と統計的推測 <code>[3/4]</code></h4>
<div class="outline-text-4" id="text-org136782f">
<ul class="org-ul">
<li class="on"><code>[X]</code> <a href="./org/Stat-estimation-2.html">./org/Stat-estimation-2.html</a>
教科書8章5節の例を説明します。</li>

<li class="on"><code>[X]</code> <a href="./org/RforS-II-04.html">./org/RforS-II-04.html</a>
<ul class="org-ul">
<li>標本不偏分散は母分散の不偏，一致推定量</li>
<li>標本不偏分散の正規化は，カイ二乗分布に従う</li>
</ul></li>

<li class="on"><code>[X]</code> 前期の内容では，下記内容が関係します：
<ul class="org-ul">
<li>確率変数の和の平均と分散，畳み込み</li>
<li><a href="https://drive.google.com/open?id=1-uXJGr0GmW9mc4yB1h1izHsoOUgpm0Y8&amp;authuser=msyk054%40gmail.com&amp;usp=drive_fs">期待値に関する公式</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb0aaec9" class="outline-4">
<h4 id="orgb0aaec9">進行チェック</h4>
<div class="outline-text-4" id="text-orgb0aaec9">
</div>
<div id="outline-container-org05346ef" class="outline-5">
<h5 id="org05346ef"><span class="done Done">Done</span> 標本と統計的推測 <code>[1/2]</code></h5>
<div class="outline-text-5" id="text-org05346ef">
<ul class="org-ul">
<li class="on"><code>[X]</code> R-4
<ul class="org-ul">
<li>正規化した標本不偏分散は，カイ二乗分布する</li>
</ul></li>
</ul>
</div>

<div id="outline-container-orgdf727db" class="outline-6">
<h6 id="orgdf727db"><span class="done Done">Done</span> 点推定 (K7, K8, R4)</h6>
<div class="outline-text-6" id="text-orgdf727db">
<ul class="org-ul">
<li>不偏性</li>
<li>一致性</li>
<li>最尤法</li>
<li>最小二乗誤差</li>
</ul>
</div>
</div>

<div id="outline-container-org8c93d54" class="outline-6">
<h6 id="org8c93d54"><span class="todo Todo">Todo</span> 区間推定 (K10)</h6>
<div class="outline-text-6" id="text-org8c93d54">
<ul class="org-ul">
<li>母平均の区間推定
<ul class="org-ul">
<li>標準化，スチューデント化による統計量</li>
<li>統計量が従う分布</li>
</ul></li>
<li>信頼度，標本誤差，信頼区間</li>
</ul>
</div>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師</p>
<p class="date">Created: 2021-11-29 月 11:40</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
